In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt

In [2]:
df1 = pd.read_csv("animes.csv")

In [3]:
df1.head()

,uid,title,synopsis,genre,aired,episodes,members,popularity,ranked,score,img_url,link
0,28891,Haikyuu!! Second Season,Following their participation at the Inter-Hig...,"['Comedy', 'Sports', 'Drama', 'School', 'Shoun...","Oct 4, 2015 to Mar 27, 2016",25.0,489888,141,25.0,8.82,https://cdn.myanimelist.net/images/anime/9/766...,https://myanimelist.net/anime/28891/Haikyuu_Se...
1,23273,Shigatsu wa Kimi no Uso,Music accompanies the path of the human metron...,"['Drama', 'Music', 'Romance', 'School', 'Shoun...","Oct 10, 2014 to Mar 20, 2015",22.0,995473,28,24.0,8.83,https://cdn.myanimelist.net/images/anime/3/671...,https://myanimelist.net/anime/23273/Shigatsu_w...
2,34599,Made in Abyss,The Abyss—a gaping chasm stretching down into ...,"['Sci-Fi', 'Adventure', 'Mystery', 'Drama', 'F...","Jul 7, 2017 to Sep 29, 2017",13.0,581663,98,23.0,8.83,https://cdn.myanimelist.net/images/anime/6/867...,https://myanimelist.net/anime/34599/Made_in_Abyss
3,5114,Fullmetal Alchemist: Brotherhood,"""In order for something to be obtained, someth...","['Action', 'Military', 'Adventure', 'Comedy', ...","Apr 5, 2009 to Jul 4, 2010",64.0,1615084,4,1.0,9.23,https://cdn.myanimelist.net/images/anime/1223/...,https://myanimelist.net/anime/5114/Fullmetal_A...
4,31758,Kizumonogatari III: Reiketsu-hen,After helping revive the legendary vampire Kis...,"['Action', 'Mystery', 'Supernatural', 'Vampire']","Jan 6, 2017",1.0,214621,502,22.0,8.83,https://cdn.myanimelist.net/images/anime/3/815...,https://myanimelist.net/anime/31758/Kizumonoga...

In [4]:
selected_columns = ['title', 'synopsis']  # Replace with your desired column names
df1 = df1[selected_columns]

In [5]:
df1.head()

,title,synopsis
0,Haikyuu!! Second Season,Following their participation at the Inter-Hig...
1,Shigatsu wa Kimi no Uso,Music accompanies the path of the human metron...
2,Made in Abyss,The Abyss—a gaping chasm stretching down into ...
3,Fullmetal Alchemist: Brotherhood,"""In order for something to be obtained, someth..."
4,Kizumonogatari III: Reiketsu-hen,After helping revive the legendary vampire Kis...

In [6]:
new_column_names = {'title': 'Name', 'synopsis': 'Description'}  # Map old names to new names
df1 = df1.rename(columns=new_column_names)

In [7]:
df1['Name'] = 'Anime | ' + df1['Name']

In [8]:
df1.head(2)

,Name,Description
0,Anime | Haikyuu!! Second Season,Following their participation at the Inter-Hig...
1,Anime | Shigatsu wa Kimi no Uso,Music accompanies the path of the human metron...

In [9]:
df2 = pd.read_csv("AnimeWorld.csv")

In [10]:
df2.head(1)

,Anime,Genre,Description,Studio,Year,Rating
0,Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season,"['Drama', 'Fantasy', 'Suspense']",A reunion that was supposed to spell the arriv...,White Fox,"Jul 8, 2020",8.37

In [11]:
selected_columns = ['Anime', 'Description']
df2 = df2[selected_columns]

In [12]:
new_column_names = {'Anime': 'Name', 'Description': 'Description'}  # Map old names to new names
df2 = df2.rename(columns=new_column_names)

In [13]:
df2.head(1)

,Name,Description
0,Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season,A reunion that was supposed to spell the arriv...

In [14]:
df2['Name'] = 'Anime | ' + df2['Name']

In [15]:
df3 = pd.read_csv("Top_Anime_data.csv")

In [16]:
df3.columns

Index(['Score', 'Popularity', 'Rank', 'Members', 'Description', 'Synonyms',
       'Japanese', 'English', 'Type', 'Episodes', 'Status', 'Aired',
       'Premiered', 'Broadcast', 'Producers', 'Licensors', 'Studios', 'Source',
       'Genres', 'Demographic', 'Duration', 'Rating'],
      dtype='object')

In [17]:
selected_columns = ['English', 'Description']
df3 = df3[selected_columns]

In [18]:
new_column_names = {'English': 'Name', 'Description': 'Description'} 
df3 = df3.rename(columns=new_column_names)

In [19]:
df3.head(2)

,Name,Description
0,Frieren: Beyond Journey's End,During their decade-long quest to defeat the D...
1,Fullmetal Alchemist: Brotherhood,After a horrific alchemy experiment goes wrong...

In [34]:
df3['Name'] = 'Anime | ' + df3['Name']

In [28]:
#df4 = pd.read_csv("hotstar.csv")

In [30]:
#selected_columns = ['title', 'description']
#df4 = df4[selected_columns]

In [31]:
#new_column_names = {'title': 'Name', 'description': 'Description'} 
#df4 = df4.rename(columns=new_column_names)

In [32]:
#df4.head(2)

,Name,Description
0,Sambha - Aajcha Chawa,A young man sets off on a mission to clean up ...
1,Cars Toon: Mater And The Ghostlight,Mater is haunted by a mysterious blue light th...

In [37]:
#df4['Name'] = 'Movie | ' + df4['Name']

In [39]:
#df4.head(1)

,Name,Description
0,Movie | Sambha - Aajcha Chawa,A young man sets off on a mission to clean up ...

In [20]:
df5 = pd.read_csv("IMDd Top Indian TV Shows.csv")

In [21]:
df5.head(1)

,Unnamed: 0,Name,Duration,Genre,Rating,No. of Ratings,No. of Episodes,Creators,Stars,Reviews (Users),Reviews (Critics),Seasons,Storyline,Language,Release Date
0,0,The Family Man,45min,"['Action', 'Comedy', 'Drama']",8.8,57797.0,19,"['Krishna D.K.', 'Raj Nidimoru']","['Manoj Bajpayee', 'Samantha Akkineni', 'Priya...",1328.0,18.0,2.0,"The Family Man is an edgy action-drama series,...",Hindi,19 September 2019 (USA)

In [22]:
selected_columns = ['Name', 'Storyline']
df5 = df5[selected_columns]

In [23]:
new_column_names = {'Name': 'Name', 'Storyline': 'Description'} 
df5 = df5.rename(columns=new_column_names)

In [24]:
df5['Name'] = 'Hindi TV Show | ' + df5['Name']

In [25]:
df5.head(1)

,Name,Description
0,Hindi TV Show | The Family Man,"The Family Man is an edgy action-drama series,..."

In [26]:
df6 = pd.read_csv("Top Indian Movies.csv")

In [27]:
df6.head(1)

,Title,Year of Release,Rating,Number of Reviews,Popularity Index,Movie Cast,Director,Description
0,Anbe Sivam,2003,8.7,21K,"11,629","['Kamal Haasan', 'Madhavan', 'Kiran Rathod', '...",Sundar C.,"Two men, one young and arrogant, the other dam..."

In [28]:
selected_columns = ['Title', 'Description']
df6 = df6[selected_columns]

In [29]:
new_column_names = {'Title': 'Name', 'Description': 'Description'} 
df6 = df6.rename(columns=new_column_names)

In [30]:
df6['Name'] = 'Hindi Movie | ' + df6['Name']

In [31]:
df6.head(2)

                       Name                                        Description
0  Hindi Movie | Anbe Sivam  Two men, one young and arrogant, the other dam...
1     Hindi Movie | Golmaal  A man's simple lie to secure his job escalates...

In [32]:
df7 = pd.read_csv("Indian_movies.csv")

In [33]:
df7.head(1)

,Unnamed: 0,Rank,Movie Names,Links,Rating,Year,Duration_of_movie,Genere,Description
0,0,1,Ramayana: The Legend of Prince Rama,https://www.imdb.com//title/tt0259534/?ref_=fe...,9.2,1993,PG,"Animation,Action,Adventure,Back to top",An anime adaptation of the Hindu epic the Rama...

In [34]:
selected_columns = ['Movie Names', 'Description']
df7 = df7[selected_columns]

In [35]:
new_column_names = {'Movie Names': 'Name', 'Description': 'Description'} 
df7 = df7.rename(columns=new_column_names)

In [36]:
df7['Name'] = 'Hindi Movie | ' + df7['Name']

In [37]:
df7.head(2)

,Name,Description
0,Hindi Movie | Ramayana: The Legend of Prince Rama,An anime adaptation of the Hindu epic the Rama...
1,Hindi Movie | Rocketry: The Nambi Effect,Based on the life of Indian Space Research Org...

In [38]:
df8 = pd.read_csv("IMDB_10000.csv")

In [39]:
df8.tail(4)

,title,year,certificate,runtime,genre,desc,rating,votes
9996,Aadmi Sadak Ka,1977,NaN,138 min,"Drama, Family",NaN,NaN,NaN
9997,Nadodi Mannan,1958,NaN,220 min,"Action, Adventure, Comedy",NaN,NaN,NaN
9998,Njan Marykutty,2018,U,126 min,Drama,NaN,NaN,NaN
9999,Paap Ko Jalaa Kar Raakh Kar Doonga,1988,UA,153 min,Crime,NaN,NaN,NaN

In [40]:
selected_columns = ['title', 'desc']
df8 = df8[selected_columns]

In [41]:
new_column_names = {'title': 'Name', 'desc': 'Description'} 
df8 = df8.rename(columns=new_column_names)

In [42]:
df8['Name'] = 'Movie | ' + df8['Name']

In [43]:
df8.head(1)

             Name                                        Description
0  Movie | Freddy  The lines between love and obsession blur in t...

In [44]:
df9 = pd.read_csv("Top Rated Movie Database.csv")

In [45]:
df9.tail(1)

,Popularity,Vote Count,Titile,Vote Average,Overview,Release Date
9999,7.576,247,Our Souls at Night,6.6,"Addie Moore and Louis Waters, a widow and wido...",2017-09-01

In [46]:
selected_columns = ['Titile', 'Overview']
df9 = df9[selected_columns]

In [47]:
new_column_names = {'Titile': 'Name', 'Overview': 'Description'} 
df9 = df9.rename(columns=new_column_names)

In [48]:
df9['Name'] = 'English Movie | ' + df9['Name']

In [49]:
df9.head(1)

                       Name                                        Description
0  English Movie | Ad Astra  The near future, a time when both hope and har...

In [50]:
df10 = pd.read_csv("imdb-movies-dataset.csv")

In [51]:
df10.tail(1)

,Poster,Title,Year,Certificate,Duration (min),Genre,Rating,Metascore,Director,Cast,Votes,Description,Review Count,Review Title,Review
9999,https://m.media-amazon.com/images/M/MV5BMmE4ZD...,Un homme et une femme,2020.0,NaN,102.0,"Drama, Romance",7.5,NaN,Claude Lelouch,"Anouk Aimée, Jean-Louis Trintignant, Pierre Ba...","11,826",A widow and a widower find their relationship ...,61,Moved me tremendously.,This is a movie that resonated to my core. I ...

In [52]:
selected_columns = ['Title', 'Description']
df10 = df10[selected_columns]

In [53]:
new_column_names = {'Title': 'Name', 'Description': 'Description'} 
df10 = df10.rename(columns=new_column_names)

In [54]:
df10['Name'] = 'English Movie | ' + df10['Name']

In [55]:
df10.head(1)

,Name,Description
0,English Movie | The Idea of You,"Solène, a 40-year-old single mom, begins an un..."

In [63]:
dfs = [df1, df2, df3, df5, df6, df7, df9, df10]

merged_df = pd.concat(dfs, ignore_index=True)

print(merged_df)

                                                    Name  \
0                        Anime | Haikyuu!! Second Season
1                        Anime | Shigatsu wa Kimi no Uso
2                                  Anime | Made in Abyss
3               Anime | Fullmetal Alchemist: Brotherhood
4               Anime | Kizumonogatari III: Reiketsu-hen
...                                                  ...
44287         English Movie | The Greatest Show on Earth
44288  English Movie | Berserk: Ougon Jidai-hen I - H...
44289                         English Movie | Is-slottet
44290                       English Movie | Loving Pablo
44291              English Movie | Un homme et une femme

                                             Description
0      Following their participation at the Inter-Hig...
1      Music accompanies the path of the human metron...
2      The Abyss—a gaping chasm stretching down into ...
3      "In order for something to be obtained, someth...
4      After helping revive the legendary vampire Kis...
...                                                  ...
44287  The dramatic lives of trapeze artists, a clown...
44288  A lone sellsword named Guts gets recruited int...
44289  A couple of twelve-year-old Norwegian girls st...
44290  A journalist strikes up a romantic relationshi...
44291  A widow and a widower find their relationship ...

[44292 rows x 2 columns]

In [79]:
csv_file_path = 'hybrid_rec.csv'
merged_df.to_csv(csv_file_path, index=False)

print(f"DataFrame saved to {csv_file_path}")

DataFrame saved to hybrid_rec.csv

In [64]:
import pandas as pd

merged_df = merged_df.sample(frac=1)  

merged_df = merged_df.reset_index(drop=True)

print(merged_df)

                                                    Name  \
0         Anime | Jouran: The Princess of Snow and Blood
1                     English Movie | Kong: Skull Island
2           Anime | Kuragehime: Soreike! Amars Tankentai
3                             English Movie | Collateral
4                         English Movie | The Invitation
...                                                  ...
44287                 English Movie | Mr. Malcolm's List
44288                              Golden Kamuy Season 2
44289  Anime | Dragon Quest X: Boukensha-tachi no Kiseki
44290                           Anime | Bubblegum Crisis
44291                English Movie | Mississippi Burning

                                             Description
0      In 1931, the Tokugawa Shogunate remains in pow...
1      Explore the mysterious and dangerous home of t...
2            The Amars go on an adventure in the forest.
3      A cab driver finds himself the hostage of an e...
4      When a man accepts an invitation to a dinner p...
...                                                  ...
44287  A young woman courts a mysterious wealthy suit...
44288  In Hokkaido, it is rumored that there is a sta...
44289  The anime celebrates the  Dragon Quest X  onli...
44290  In the near future, Tokyo was left flattened a...
44291  Two F.B.I. Agents with wildly different styles...

[44292 rows x 2 columns]

In [65]:
merged_df = merged_df.drop_duplicates()

In [66]:
merged_df.shape

(40345, 2)

In [77]:
import pandas as pd
import re
import nltk
import pickle
from nltk.corpus import stopwords
from nltk.stem import WordNetLemmatizer
from sklearn.feature_extraction.text import CountVectorizer

# Ensure NLTK resources are downloaded
nltk.download('stopwords')
nltk.download('wordnet')

# Initialize the lemmatizer and stop words
lemmatizer = WordNetLemmatizer()
stop_words = set(stopwords.words('english'))

# Text preprocessing function
def preprocess_text(text):
    if isinstance(text, str):
        text = text.lower()
        text = re.sub(r'[^a-zA-Z0-9\s|]', '', text)
        text = ' '.join(
            lemmatizer.lemmatize(word) for word in text.split() if word not in stop_words
        )
    else:
        text = ''
    return text

merged_df['Preprocessed_Description'] = merged_df['Description'].apply(preprocess_text)
merged_df['Preprocessed_Name'] = merged_df['Name'].apply(preprocess_text)
merged_df['Preprocessed_Text'] = merged_df['Preprocessed_Name'] + ' ' + merged_df['Preprocessed_Description']

# Create Count Vectorizer
vectorizer = CountVectorizer()
bow_matrix = vectorizer.fit_transform(merged_df['Preprocessed_Text'])

# Save the model and vectorizer using pickle
with open('bow_vectorizer.pkl', 'wb') as f:
    pickle.dump(vectorizer, f)
    
with open('bow_matrix.pkl', 'wb') as f:
    pickle.dump(bow_matrix, f)
    
with open('merged_df.pkl', 'wb') as f:
    pickle.dump(merged_df, f)

[nltk_data] Downloading package stopwords to
[nltk_data]     C:\Users\diwak\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!
[nltk_data] Downloading package wordnet to
[nltk_data]     C:\Users\diwak\AppData\Roaming\nltk_data...
[nltk_data]   Package wordnet is already up-to-date!

In [78]:
# Example usage
input_text = "harry potter"
recommendations = recommend_similar(input_text)

print(f"Recommended movies based on '{input_text}':")
for movie in recommendations:
    print(movie)

ValueError: Incompatible dimension for X and Y matrices: X.shape[1] == 79852 while Y.shape[1] == 79895

In [69]:
csv_file_path = 'AllinOne.csv'
merged_df.to_csv(csv_file_path, index=False)

print(f"DataFrame saved to {csv_file_path}")

DataFrame saved to AllinOne.csv